/*
Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.
*/

int number = new Random().Next(10, 100);
Console.WriteLine(number);
